daniluxa/MyProjects/lic_module_zigbee_mcu/STM32_WPAN/App/app_zigbee.c
  /* Configure the joining parameters */
  zigbee_app_info.join_status = (enum ZbStatusCodeT) 0x01; /* init to error status */
  zigbee_app_info.join_delay = HAL_GetTick(); /* now */
  zigbee_app_info.startupControl = ZbStartTypeForm;

  /* Initialization Complete */
  zigbee_app_info.has_init = true;

  /* run the task */
  UTIL_SEQ_SetTask(1U << CFG_TASK_ZIGBEE_NETWORK_FORM, CFG_SCH_PRIO_0);
} /* APP_ZIGBEE_StackLayersInit */

/**
 * @brief  Configure Zigbee application endpoints
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_ConfigEndpoints(void)
{
  struct ZbApsmeAddEndpointReqT req;
  struct ZbApsmeAddEndpointConfT conf;

  memset(&req, 0, sizeof(req));

  /* Endpoint: SW1_ENDPOINT */
  req.profileId = ZCL_PROFILE_HOME_AUTOMATION;
  req.deviceId = ZCL_DEVICE_COMBINED_INTERFACE;
  req.endpoint = SW1_ENDPOINT;
  ZbZclAddEndpoint(zigbee_app_info.zb, &req, &conf);
  assert(conf.status == ZB_STATUS_SUCCESS);

  /* Pressure meas client */
  zigbee_app_info.pressure_meas_client_1 = ZbZclPressMeasClientAlloc(zigbee_app_info.zb, SW1_ENDPOINT);
  assert(zigbee_app_info.pressure_meas_client_1 != NULL);
  zigbee_app_info.pressure_meas_client_1->report = &zcl_press_meas_client_report;
  ZbZclClusterEndpointRegister(zigbee_app_info.pressure_meas_client_1);

  /* Temperature meas client */
  zigbee_app_info.temperature_meas_client_1 = ZbZclTempMeasClientAlloc(zigbee_app_info.zb, SW1_ENDPOINT);
  assert(zigbee_app_info.temperature_meas_client_1 != NULL);
  zigbee_app_info.temperature_meas_client_1->report = &zcl_temp_meas_client_report;
  ZbZclClusterEndpointRegister(zigbee_app_info.temperature_meas_client_1);

  /* Water content client */
  zigbee_app_info.water_content_client_1 = ZbZclWaterContentMeasClientAlloc(zigbee_app_info.zb, SW1_ENDPOINT, ZCL_CLUSTER_MEAS_HUMIDITY);
  assert(zigbee_app_info.water_content_client_1 != NULL);
  zigbee_app_info.water_content_client_1->report = &zcl_wc_meas_client_report;
  ZbZclClusterEndpointRegister(zigbee_app_info.water_content_client_1);

  /* USER CODE BEGIN CONFIG_ENDPOINT */
  /* USER CODE END CONFIG_ENDPOINT */
} /* APP_ZIGBEE_ConfigEndpoints */


/* pressure report received from server*/
static void
zcl_press_meas_client_report(struct ZbZclClusterT *clusterPtr, struct ZbApsdeDataIndT *dataIndPtr, uint16_t attributeId,
    enum ZclDataTypeT dataType, const uint8_t *in_payload, uint16_t in_len)
{  
    int attrLen;
    int16_t attr_val;

    /* Verify the source of the reported attribute. */
    /*if(dataIndPtr->src.nwkAddr!=nwkAddr) 
    {
      APP_DBG("[PRESS MEAS] Report error wrong source addr");
        return;
    }*/
    if (dataIndPtr->src.endpoint!= SW1_ENDPOINT) 
    {
        APP_DBG("[PRESS MEAS] Report error wrong endpoint");
        return;
    }
    if (attributeId == ZCL_PRESS_MEAS_ATTR_MEAS_VAL)
    {

        APP_DBG("[PRESS MEAS] Received a report from Server");
        attrLen = ZbZclAttrParseLength(dataType, in_payload, dataIndPtr->asduLength, 0);
        if (attrLen < 0) {
            return;
        }
        if (attrLen > (int)in_len) {
           return;
        }
    
        attr_val= pletoh16(in_payload);
        
        for (int i = 0; i < MAX_SENSOR_COUNT; i++){
          if (dataIndPtr->src.nwkAddr == zigbee_app_data.AqaraSensor[i].address){
            zigbee_app_data.AqaraSensor[i].pressure = (int16_t)attr_val;
            zigbee_app_data.AqaraSensor[i].LQI = dataIndPtr->linkQuality;
            
            zigbee_app_data.AqaraSensor[i].pressure_new = true;
            if (zigbee_app_data.AqaraSensor[i].temperature_new == true &&
                zigbee_app_data.AqaraSensor[i].water_content_new == true){
                  zigbee_app_data.AqaraSensor[i].all_new = true;
                  UTIL_SEQ_SetTask(1U << CFG_TASK_SEND_NEW_DATA, CFG_SCH_PRIO_0);
                }
          }      
        }
    }
  
} /* zcl_press_meas_client_report */


/* temperature report received from server*/
static void
zcl_temp_meas_client_report(struct ZbZclClusterT *clusterPtr, struct ZbApsdeDataIndT *dataIndPtr, uint16_t attributeId,
    enum ZclDataTypeT dataType, const uint8_t *in_payload, uint16_t in_len)
{
    int attrLen;
    int16_t attr_val;

    /* Verify the source of the reported attribute. */
    /*if(dataIndPtr->src.nwkAddr!=nwkAddr) 
    {
      APP_DBG("[TEMP MEAS] Report error wrong source addr");
        return;
    }*/
    if (dataIndPtr->src.endpoint!= SW1_ENDPOINT) 
    {
        APP_DBG("[TEMP MEAS] Report error wrong endpoint");
        return;
    }
    if (attributeId == ZCL_TEMP_MEAS_ATTR_MEAS_VAL)
    {

        APP_DBG("[TEMP MEAS] Received a report from Server");
        attrLen = ZbZclAttrParseLength(dataType, in_payload, dataIndPtr->asduLength, 0);
        if (attrLen < 0) {
            return;
        }
        if (attrLen > (int)in_len) {
           return;
        }
    
        attr_val= pletoh16(in_payload);
        
        for (int i = 0; i < MAX_SENSOR_COUNT; i++){
          if (dataIndPtr->src.nwkAddr == zigbee_app_data.AqaraSensor[i].address){
            zigbee_app_data.AqaraSensor[i].temperature = (int16_t)attr_val;
            zigbee_app_data.AqaraSensor[i].LQI = dataIndPtr->linkQuality;
            
            zigbee_app_data.AqaraSensor[i].temperature_new = true;
            if (zigbee_app_data.AqaraSensor[i].pressure_new == true &&
                zigbee_app_data.AqaraSensor[i].water_content_new == true){
                  zigbee_app_data.AqaraSensor[i].all_new = true;
                  UTIL_SEQ_SetTask(1U << CFG_TASK_SEND_NEW_DATA, CFG_SCH_PRIO_0);
                }
          }      
        }
    }
  
} /* zcl_press_meas_client_report */


/* water content report received from server*/
static void
zcl_wc_meas_client_report(struct ZbZclClusterT *clusterPtr, struct ZbApsdeDataIndT *dataIndPtr, uint16_t attributeId,
    enum ZclDataTypeT dataType, const uint8_t *in_payload, uint16_t in_len)
{  
    int attrLen;
    int16_t attr_val;

    /* Verify the source of the reported attribute. */
    /*if(dataIndPtr->src.nwkAddr!=nwkAddr) 
    {
      APP_DBG("[HUMIDITY MEAS] Report error wrong source addr");
        return;
    }*/
    if (dataIndPtr->src.endpoint!= SW1_ENDPOINT) 
    {
        APP_DBG("[HUMIDITY MEAS] Report error wrong endpoint");
        return;
    }
    if (attributeId == ZCL_WC_MEAS_ATTR_MEAS_VAL)
    {

        APP_DBG("[HUMIDITY MEAS] Received a report from Server");
        attrLen = ZbZclAttrParseLength(dataType, in_payload, dataIndPtr->asduLength, 0);
        if (attrLen < 0) {
            return;
        }
        if (attrLen > (int)in_len) {
           return;
        }
    
        attr_val= pletoh16(in_payload);
        
        for (int i = 0; i < MAX_SENSOR_COUNT; i++){
          if (dataIndPtr->src.nwkAddr == zigbee_app_data.AqaraSensor[i].address){
            zigbee_app_data.AqaraSensor[i].water_content = (int16_t)attr_val;
            zigbee_app_data.AqaraSensor[i].LQI = dataIndPtr->linkQuality;
            
            zigbee_app_data.AqaraSensor[i].water_content_new = true;
            if (zigbee_app_data.AqaraSensor[i].pressure_new == true &&
                zigbee_app_data.AqaraSensor[i].temperature_new == true){
                  zigbee_app_data.AqaraSensor[i].all_new = true;
                  UTIL_SEQ_SetTask(1U << CFG_TASK_SEND_NEW_DATA, CFG_SCH_PRIO_0);
                }
          }      
        }
    }
  
